# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# Пример:

# - 6782 -> 23
# - 0,56 -> 11


def count_digits(numb: int, float) -> int:
    pass


number = float(input('Введите число -> '))
print(count_digits(number))